eisup_2019_docmng_integration/src/Documents/СправкаПоНДФЛСотруднику/СправкаПоНДФЛСотруднику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СправкаПоНДФЛСотруднику</name>
  <comment>(Регл)</comment>
  <posting>Deny</posting>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НалоговыйПериод</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОКАТО_КПП</name>
    <comment>(Регл)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>21</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособФормирования</name>
    <type>
      <types>EnumRef.ПорядокФормированияСправкиОДоходахФизлица</types>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СправкуПодписал</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностьПодписавшегоЛица</name>
    <type>
      <types>CatalogRef.ДолжностиОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Ставка</name>
    <type>
      <types>EnumRef.НДФЛСтавки</types>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресРФ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>240</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДокумента</name>
    <type>
      <types>CatalogRef.ДокументыУдостоверяющиеЛичность</types>
    </type>
  </attributes>
  <attributes>
    <name>СерияДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбщаяСуммаДохода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОблагаемаяСуммаДохода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Исчислено</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Задолженность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИзлишнеУдержано</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Удержано</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Перечислено</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресЗарубежом</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>240</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <comment>(Общ)</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <comment>(Регл)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Гражданство</name>
    <type>
      <types>CatalogRef.КлассификаторСтранМира</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусНалогоплательщика</name>
    <type>
      <types>EnumRef.СтатусыНалогоплательщиковПоНДФЛ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУведомления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерУведомления</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодНалоговогоОрганаУведомления</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпециальныйДокумент2011года</name>
    <comment>Ведет себя по правилам 2010 года.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СведенияОДоходах</name>
    <attributes>
      <name>Месяц</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодДохода</name>
      <type>
        <types>CatalogRef.ДоходыНДФЛ</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаДохода</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодВычета</name>
      <type>
        <types>CatalogRef.ВычетыНДФЛ</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВычета</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СведенияОВычетах</name>
    <attributes>
      <name>КодВычета</name>
      <type>
        <types>CatalogRef.ВычетыНДФЛ</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВычета</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СуммыНалогов</name>
    <attributes>
      <name>Ставка</name>
      <type>
        <types>EnumRef.НДФЛСтавки</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбщаяСуммаДохода</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОблагаемаяСуммаДохода</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Исчислено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Удержано</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Перечислено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИзлишнеУдержано</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Задолженность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

eisup_2019_docmng_integration/src/Enums/ПорядокФормированияСправкиОДоходахФизлица/ПорядокФормированияСправкиОДоходахФизлица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПорядокФормированияСправкиОДоходахФизлица</name>
  <comment>(Регл)</comment>
  <enumValues>
    <name>ДляПередачиВИФНС</name>
  </enumValues>
  <enumValues>
    <name>ФизлицуСводно</name>
  </enumValues>
  <enumValues>
    <name>ФизлицуВРазрезеКодовОКАТО</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Enums/НДФЛСтавки/НДФЛСтавки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>НДФЛСтавки</name>
  <comment>(Регл)</comment>
  <enumValues>
    <name>Ставка13</name>
  </enumValues>
  <enumValues>
    <name>Ставка30</name>
  </enumValues>
  <enumValues>
    <name>Ставка09</name>
  </enumValues>
  <enumValues>
    <name>Ставка35</name>
  </enumValues>
  <enumValues>
    <name>Ставка15</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Documents/СправкаПоНДФЛСотруднику/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

#Если ТолстыйКлиентОбычноеПриложение Тогда

Функция ПечатьСправки()
	
	СтруктураДанныхНА = СправкиПоНДФЛ.ДанныеНалоговогоАгентаДля2НДФЛ(Организация, НалоговыйПериод, ОКАТО_КПП, Дата, Телефон, ДолжностьПодписавшегоЛица, СправкуПодписал);
	СтруктураДанныхНА.Признак = ?(СпособФормирования = Перечисления.ПорядокФормированияСправкиОДоходахФизлица.ФизлицуСводно,"СводнаяСправка","");
	
	ТаблицаДанныхСотрудников = Новый ТаблицаЗначений;
	Для каждого Реквизит Из Метаданные.Документы.СправкаПоНДФЛВНалоговыйОрган.ТабличныеЧасти.СотрудникиОрганизации.Реквизиты Цикл
		Если Реквизит.Имя = "НомерСправки" Тогда // номер справки в этом документе - строковый
			Продолжить;
		КонецЕсли;
		ТаблицаДанныхСотрудников.Колонки.Добавить(Реквизит.Имя,Реквизит.Тип);
	КонецЦикла;
	ТаблицаДанныхСотрудников.Колонки.Добавить("НомерСправки", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(11)));
	СтрокаДанных = ТаблицаДанныхСотрудников.Добавить();
	ЗаполнитьЗначенияСвойств(СтрокаДанных,ЭтотОбъект);
	СтрокаДанных.НомерСправки = ОбщегоНазначения.ПолучитьНомерНаПечать(ЭтотОбъект);
	
	ТаблицаДанныхОДоходах = СведенияОДоходах.Выгрузить();
	ТаблицаДанныхОДоходах.Колонки.Добавить("НомерСправки", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(11)));
	ТаблицаДанныхОДоходах.ЗаполнитьЗначения(СтрокаДанных.НомерСправки,"НомерСправки");
	
	ТаблицаДанныхОВычетах = СведенияОВычетах.Выгрузить();
	ТаблицаДанныхОВычетах.Колонки.Добавить("НомерСправки", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(11)));
	ТаблицаДанныхОВычетах.ЗаполнитьЗначения(СтрокаДанных.НомерСправки,"НомерСправки");
	
	ТаблицаИтоговыхДанных = СуммыНалогов.Выгрузить();
	ТаблицаИтоговыхДанных.Колонки.Добавить("НомерСправки", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(11)));
	ТаблицаИтоговыхДанных.ЗаполнитьЗначения(СтрокаДанных.НомерСправки,"НомерСправки");
	
	Возврат СправкиПоНДФЛ.ПечатьСправок2НДФЛ(Ссылка, СтруктураДанныхНА, ТаблицаДанныхСотрудников, ТаблицаДанныхОДоходах, ТаблицаДанныхОВычетах, ТаблицаИтоговыхДанных)	

КонецФункции // ПечатьСправки()
	
	
// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходимое количество копий.
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Функция Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь) Экспорт
	
	Если Не РаботаСДиалогами.ПроверитьМодифицированность(ЭтотОбъект) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ОбработкаКомментариев = глЗначениеПеременной("глОбработкаСообщений");
	ОбработкаКомментариев.УдалитьСообщения();
	
	ТабДокумент = Неопределено;
	
	// Получить экземпляр документа на печать
	Если ИмяМакета = "Справка" Тогда
		ТабДокумент = ПечатьСправки();
	КонецЕсли;

	ОбработкаКомментариев.ПоказатьСообщения();
	
	Возврат УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, ttk_ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект,"Справка о доходах (2-НДФЛ) "));
	
КонецФункции // Печать

#КонецЕсли

Процедура ЗаполнитьРеквизитыЗначениямиПоУмолчанию() Экспорт
	
	ЗаполнениеДокументовПереопределяемый.ЗаполнитьШапкуДокумента(ЭтотОбъект, глЗначениеПеременной("глТекущийПользователь"));
	
	Если НЕ ЗначениеЗаполнено(Дата) Тогда
		Дата = ОбщегоНазначенияЗК.ПолучитьРабочуюДату();
	КонецЕсли;
	
	Если НалоговыйПериод = 0 Тогда 
		НалоговыйПериод = Макс(Год(Дата) - ?(Месяц(Дата) = 1, 1, 0), 2010);
		Если ЗначениеЗаполнено(Организация) Тогда
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, СправкиПоНДФЛ.ДанныеПодписывающихЛиц(Организация, Дата));
		КонецЕсли;
		СпособФормирования = Перечисления.ПорядокФормированияСправкиОДоходахФизлица.ФизлицуВРазрезеКодовОКАТО;
		Ставка = Перечисления.НДФЛСтавки.Ставка13;
	КонецЕсли;
	
КонецПроцедуры

// Возвращает доступные варианты печати документа
//
// Возвращаемое значение:
//  Струткура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	СтруктураПечатныхФорм = Новый Структура("Справка", "2-НДФЛ");
	
	Возврат СтруктураПечатныхФорм;

КонецФункции // ПолучитьСтруктуруПечатныхФорм()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НалоговыйПериод = 0 Тогда // документ без налогового периода неконсистентен
		НалоговыйПериод = Макс(Год(Дата),2010);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(Основание)
	
	Если ТипЗнч(Основание) = Тип("СправочникСсылка.СотрудникиОрганизаций") Тогда
		
		Дата = ОбщегоНазначенияЗК.ПолучитьРабочуюДату();
		
		ДанныеСотрудника = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Основание, "Физлицо, Организация");
		ЭтотОбъект.Сотрудник = ДанныеСотрудника.Физлицо;
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеСотрудника);
		
		ЗаполнитьРеквизитыЗначениямиПоУмолчанию();
		
		СписокОКАТОиКПП = СправкиПоНДФЛ.СписокОКАТОиКПП(Организация);
		
		ОКАТО_КПП = ?(СписокОКАТОиКПП.Количество() > 0, СписокОКАТОиКПП[0].Значение, "");
		
		СправкиПоНДФЛ.ПрочитатьДанныеСотрудника(ЭтотОбъект, Дата, НалоговыйПериод);
		СправкиПоНДФЛ.ПрочитатьДанныеСправки(ЭтотОбъект, СведенияОДоходах, СведенияОВычетах, СуммыНалогов, НалоговыйПериод, Организация, ОбщегоНазначения.ГоловнаяОрганизация(Организация), ?(СпособФормирования = Перечисления.ПорядокФормированияСправкиОДоходахФизлица.ФизлицуВРазрезеКодовОКАТО, ОКАТО_КПП, Неопределено), КонецМесяца(Дата) + 1)
		
	КонецЕсли;
	
КонецПроцедуры
